ПУМП/src/Catalogs/V006/V006.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>V006</name>
  <comment>Классификатор Условий Оказания Медицинской Помощи (V006)</comment>
  <attributes>
    <name>ID</name>
    <comment>ИД условия</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NAME</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DATE_BEG</name>
    <comment>Дата начала</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DATE_END</name>
    <comment>Дата окончания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

ПУМП/src/Catalogs/V006/ObjectModule.bsl
//@skip-warning
//Предопределенная процедура
Процедура ПередЗаписью(Отказ)
//	пДлинаКода=ЭтотОбъект.Метаданные().Реквизиты["ID"].Тип.КвалификаторыЧисла.Длина;
	пДлинаИд=2;
	пНовый=ЭтотОбъект.ЭтоНовый();
	пКод=ОбщегоНазначенияПГБ2.StrZero(ЭтотОбъект.ID,пДлинаИд);
	Если (Не (ЭтотОбъект.DATE_BEG=Неопределено)) Тогда
		пКод=пКод+"-"+ОбщегоНазначенияПГБ2.DTOS(ЭтотОбъект.DATE_BEG);
	КонецЕсли;	
	Код=пКод;
	Если пНовый Тогда
		ЭтотОбъект.ДатаСоздания=ТекущаяДата();
		ЭтотОбъект.ДатаИзменения=ЭтотОбъект.ДатаСоздания;
	Иначе
		ЭтотОбъект.ДатаИзменения=ТекущаяДата();
	КонецЕсли;	
КонецПроцедуры
